app/controllers/ip_assets_controller.rb

SELECT  `ip_assets`.* FROM `ip_assets` WHERE `ip_assets`.`id` = 4 LIMIT 1
SELECT `ip_assets`.* FROM `ip_assets`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `ip_assets` (`Research_group_ID`, `Type`, `Labs_Associated`, `created_at`, `updated_at`) VALUES (1, 'ab', 'cdvcv', '2016-11-12 11:41:48', '2016-11-12 11:41:48')
---
  def set_approved
    @ip_asset = IpAsset.find(params[:ip_asset])
    a=0
    p "Current Use"
      p current_user.id
    @ip_asset.ownerships.each do |owner|
      p "Looping user"
      p owner.user_id
      if(owner.user_id==current_user.id)
        p "in loop"
        # @ip_asset.errors.add(:status,message:"Cant Approve")
        redirect_to ip_assets_url, :flash=>{:error => "\t You cant approve"}
        # break
        return
      end
    end
    @ip_asset.status='Approved'
    @ip_asset.Approval_id=current_user.id
    @ip_asset.Approver_name = (User.find_by id: current_user.id).name
    @ip_asset.save
    # @ownership=Ownership.create(:ip_asset_id=> @ip_asset.id,:user_id=>@ip_asset.user_id)
    @owners=Ownership.where(:ip_asset_id=>params[:ip_asset])
    @owners.each do |owner|
    @notification = Notification.create(:user_id=>owner.user_id,:content=>  " Your IP Asset:{@ip_asset.Description} has been approved")

DELETE FROM `ip_assets` WHERE `ip_assets`.`id` = 4
---
  def set_edit
   @ip_asset = IpAsset.find(params[:ip_asset])
   @ip_asset1 = IpAsset.new
   @ip_asset1 = IpAsset.find_by Original_id: @ip_asset.id
   @ip_asset1.destroy