app/controllers/not_approved_ip_assets_controller.rb

  def index
    @not_approved_ip_assets = NotApprovedIpAsset.all
---
SELECT `not_approved_ip_assets`.* FROM `not_approved_ip_assets`

  def create
    @not_approved_ip_asset = NotApprovedIpAsset.new(not_approved_ip_asset_params)
    # @owner=@not_approved_ip_asset.owner
    @not_approved_ip_asset.owner_id=current_user.id
    respond_to do |format|
      if @not_approved_ip_asset.save
---
INSERT INTO `not_approved_ip_assets` (`Research_group_ID`, `Type`, `Labs_Associated`, `created_at`, `updated_at`, `user_id`) VALUES (12, '', '', '2016-11-14 02:43:01', '2016-11-14 02:43:01', 2)

    def set_not_approved_ip_asset
      @not_approved_ip_asset = NotApprovedIpAsset.find(params[:id])
---
SELECT  `not_approved_ip_assets`.* FROM `not_approved_ip_assets` WHERE `not_approved_ip_assets`.`id` = 1 LIMIT 1